#include "z_kaleido_scope.h"
#include "file_select_state.h"

#include "libu64/gfxprint.h"
#include "array_count.h"
#include "controller.h"
#include "gfx_setupdl.h"
#include "sfx.h"
#include "printf.h"
#include "play_state.h"
#include "save.h"

void KaleidoScope_SwitchTabItemEditor(void);

typedef enum ItemEditorTabs {
    /* 0xFF */ ITEM_EDITOR_TAB_SELECT = -1,
    /* 0x00 */ ITEM_EDITOR_TAB_ITEMS,
    /* 0x01 */ ITEM_EDITOR_TAB_AMMO,
    /* 0x02 */ ITEM_EDITOR_TAB_EQUIPMENT,
    /* 0x03 */ ITEM_EDITOR_TAB_UPGRADES,
    /* 0x04 */ ITEM_EDITOR_TAB_SONGS,
    /* 0x05 */ ITEM_EDITOR_TAB_QUEST,
    /* 0x06 */ ITEM_EDITOR_TAB_DUNGEON_KEYS,
    /* 0x07 */ ITEM_EDITOR_TAB_DUNGEON_QUEST,
    /* 0x08 */ ITEM_EDITOR_TAB_RESET_SCENE_FLAGS,
    /* 0x09 */ ITEM_EDITOR_TAB_MAX
} ItemEditorTabs;

typedef struct ItemEditorEntry {
    /* 0x00 */ u8 param1, param2, param3;
    /* 0x04 */ char* name;
    /* 0x08 */ void  (*setFunc) (u8, u8, u8, struct PlayState*);
    /* 0x0C */ char* (*getFunc) (u8, u8, u8);
} ItemEditorEntry; // size = 0x10

typedef struct ItemEditorState {
    /* 0x00 */ ItemEditorEntry* entries;
    /* 0x04 */ s16 verticalInputAccumulator, verticalInput;
    /* 0x08 */ u8 count, topDisplayedEntry, topDisplayedTabEntry, timerUp, timerDown;
    /* 0x0D */ s8 tab, currentEntry, currentTabEntry;
    /* 0x10 */ bool lockUp, lockDown;
    /* 0x12 */ s8 savedEntry[ITEM_EDITOR_TAB_MAX];
    /* 0x19 */ u8 savedTopEntry[ITEM_EDITOR_TAB_MAX];
} ItemEditorState; // size = 0x20

ItemEditorState state;

bool firstTimeUse = false;

void ItemEditor_SetItem(u8 firstItem, u8 lastItem, u8 slot, PlayState* play) {
    if (play->state.input[0].press.button == BTN_A) {
        if (gSaveContext.save.info.inventory.items[slot] == ITEM_NONE)
            gSaveContext.save.info.inventory.items[slot] = firstItem;
        else if (gSaveContext.save.info.inventory.items[slot] < lastItem)
            gSaveContext.save.info.inventory.items[slot]++;
        else gSaveContext.save.info.inventory.items[slot] = ITEM_NONE;
    } else if (play->state.input[0].press.button == BTN_B) {
        if (gSaveContext.save.info.inventory.items[slot] == ITEM_NONE)
            gSaveContext.save.info.inventory.items[slot] = lastItem;
        else if (gSaveContext.save.info.inventory.items[slot] > firstItem)
            gSaveContext.save.info.inventory.items[slot]--;
